Revit 2024 API
ViewSystemsAnalysisReport.IsAnalysisCompleted Method
 Indicates if the background systems analysis has completed or not.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public bool IsAnalysisCompleted()
Visual Basic
Public Function IsAnalysisCompleted As Boolean
Visual C++
public:
bool IsAnalysisCompleted()
Return Value
 True if completed, otherwise false.
See Also
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace